---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsError
source: html/e9f8e2dc-f148-0cdc-3a8b-091c6122857f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CantPlaceInsertsError Property

Can't place inserts outside of hosts. These elements won't be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantPlaceInsertsError { get; }
```